## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.hub_network.azurerm_monitor_diagnostic_setting.settings will be created
  + resource "azurerm_monitor_diagnostic_setting" "settings" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "DiagnosticsSettings"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "VMProtectionAlerts"
            # (1 unchanged attribute hidden)
        }

      + log (known after apply)

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.hub_network.azurerm_subnet.subnet["AzureBastionSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.1.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "AATest2RG"
      + virtual_network_name                           = "AATest1HubVNet"
    }

  # module.hub_network.azurerm_subnet.subnet["AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.1.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallSubnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "AATest2RG"
      + virtual_network_name                           = "AATest1HubVNet"
    }

  # module.hub_network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "AATest1HubVNet"
      + resource_group_name = "AATest2RG"
      + subnet              = (known after apply)
      + tags                = {
          + "createdWith" = "Terraform"
        }
    }

  # module.log_analytics_workspace.azurerm_log_analytics_workspace.log_analytics_workspace will be created
  + resource "azurerm_log_analytics_workspace" "log_analytics_workspace" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "uksouth"
      + name                            = "AATest1AksWorkspace"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "AATest2RG"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "module" = "log_analytics"
        }
      + workspace_id                    = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>